tutorials/catalyticWallsReactingFoam/twoSpheres/0.org/Ysdefault.catalyst
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ysdefault.catalyst;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{    
	reactingWall
    {
        type            calculated;
        value           $internalField;
    }
    inertWall
    {
        type            calculated;
        value           $internalField;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    "(front|back)"
    {
        type            wedge;
    }
}


// ************************************************************************* //
